---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SiteSubRegion Methods
SiteSubRegion Class See Also Send Feedback
---

The SiteSubRegion type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, IList<(Of <<'(CurveLoop>)>>)) | **Obsolete.** Creates a new SiteSubRegion element and adds it to the document. |
|  | Create(Document, IList<(Of <<'(CurveLoop>)>>), ElementId) | **Obsolete.** Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document. |
|  | Dispose |  |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | GetBoundary | Gets the boundary of current subregion. |
|  | GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | IsValidBoundary | Identifies whether the given curve loops compose a valid boundary. |
|  | SetBoundary | **Obsolete.** Set the given curve loops as the boundary of an existing SiteSubRegion. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also

SiteSubRegion Class

Autodesk.Revit.DB.Architecture Namespace